#1)რა არის პირობითი ოპერატორები არის სიმბოლოები რომლებიც გამოიყენება შედარებისთვის. ისინი გვეხმარებიან შევამოწმოთ რომელია მეტი ნაკლები ნაკლებიაან ტოლი
#2)რა არის ლოგიკური ოპერატორები გამოიყენება რამდენიმე პირობის ერთიანად შესამოწმებლად and ორივე პირობა true უნდა იყოს or ერთერთი მაინც true უნდა იყოს
#3) მოცემულია რიცხვი num. შეამოწმე, არის თუ არა რიცხვი დადებითი და ლუწი. თუ ორივე პირობა შესრულდა, დაბეჭდე "რიცხვი დადებითი და ლუწია", წინააღმდეგ შემთხვევაში —    "პირობა არ შესრულდა". 

num = int(input("enter number "))

if num > 0 and num % 2 == 0:
    print("რიცხვი დადებითი და ლუწია")
else:
    print("პირობა არ შესრულდა")