//1)შექმენი პროგრამა, რომელიც prompt()-ით კითხავს მოსწავლის სახელს, შემდეგ კი alert()-ით აჩვენებს მისალმებას.
//მაგალითი: თუ მოსწავლემ ჩაწერა „ნიკა“, უნდა გამოჩნდეს: მოგესალმებით, ნიკა!
let name = prompt("რა გქვია?");
alert("მოგესალმებით, " + name + "!");
console.log(name)

//2) კითხე მოსწავლეს: „რა არის შენი საყვარელი საგანი სკოლაში?“ შემდეგ აჩვენე alert-ით: შენი საყვარელი საგანია მათემატიკა!
let favoriteSubject = prompt("რა არის შენი საყვარელი საგანი სკოლაში?");
alert("შენი საყვარელი საგანია " + favoriteSubject + "!");
console.log(favoriteSubject)

//3) კითხე მოსწავლეს ასაკი prompt()-ით და აჩვენე შედეგი alert-ში.
let age = prompt("რა არის შენი ასაკი?");
alert("შენი ასაკი არის "+ age + "წელი")
console.log(age)