//1)სთხოვეთ მომხმარებელს შეიყვანოს თავისი ასაკი prompt()-ით. თუ მომხმარებელი შეიყვანს 18-ზე ნაკლებ რიცხვს, alert()-ით გამოუტანეთ შეტყობინება: "წვდომა შეზღუდულია". სხვა შემთხვევაში (18 ან მეტი) გამოუტანეთ: "წვდომა დაშვებულია".
let age = prompt("შეიყვანე შენი ასაკი");
if (age < 18) {
    alert("წვდომა შეზღუდულია")
}

//2) შექმენით პროგრამა, რომელიც ზედიზედ ორჯერ ამოაგდებს prompt() ფანჯარას და მომხმარებელს სთხოვს ორ სხვადასხვა რიცხვს. ბოლოს alert()-ის მეშვეობით აჩვენეთ ამ ორი რიცხვის ჯამი. (გაითვალისწინეთ: prompt-იდან მიღებული მნიშვნელობა ყოველთვის ტექსტია, ამიტომ დაგჭირდებათ მისი რიცხვად გარდაქმნა)

let num = prompt("შეიყვანე პირველი რიცხვი");
let num2 = prompt("შეიყვანე მეორე რიცხვი");
let sum = Number(num) + Number(num2);
alert("ორი რიცხვის ჯამი არის " + sum)


//3) შექმენით პროგრამა, რომელიც მომხმარებელს სთხოვს პროდუქტის საწყის ფასს.
//პირველი prompt()-ით მოითხოვეთ ნივთის ფასი.
//მეორე prompt()-ით მოითხოვეთ ფასდაკლების პროცენტი (მაგალითად: 20).
//პროგრამამ უნდა გამოთვალოს საბოლოო ფასი ფორმულით: $ფასი - (ფასი \times პროცენტი / 100)$.
//alert()-ით გამოიტანეთ შეტყობინება: "თქვენი ნივთის ფასი ფასდაკლების შემდეგ არის: [შედეგი] ლარი".

let product = prompt("შეიყვანე პროდუქტის საწყისი ფასი");
let product2 = prompt("შეიყვანე ფასდაკლების პროცენტი");
let finalprice =  Number(product) - (Number(product) * Number(product2) / 100);
alert("თქვენი ნივთის ფასი ფასდაკლების შემდეგ არის: " + finalprice + " ლარი.")
console.log(finalprice)

//4)რა განსხვავებაა prompt ცნებასა და alert ცნებას შორის განმარტეთ თეორიულად რაც მთავარია გაიაზრეთ
//prompt() არის ფუნქცია რომელიცც მომხმარებელს სთხოვს შეიყვანოს ინფორმაცია და ამ ინფორმაციას ინახავს ცვლადში. მაგალითად, თუ გვსურს მომხმარებელმა შეიყვანოს თავისი სახელი, გამოვიყენებთ prompt()-ს და შევინახავთ ამ ინფორმაციას ცვლადში, რომელსაც შემდეგ გამოვიყენებთ.
//alert() არის ფუნქცია რომელიც მომხმარებელს აჩვენებს შეტყობინებას. ეს ფუნქცია არ ითხოვს ინფორმაციას მომხმარებლისგან, არამედ უბრალოდ აჩვენებს ტექსტს ან მონაცემებს. მაგალითად თუ გვსურს მომხმარებელს მივაწოდოთ ინფორმაცია როგორიცაა "მოგესალმებით, ნიკა!" გამოვიყენებთ alert()-ს.


//5)შეგვიძლია თუ არა alert  და prompt-ის გაერთიანება თუ კი მომიყვანეთ მაგალითი, თუ არა რატომ?
//კი შეგვიძლია ერთად გამოვიყენოთ მაგალითად შეგვიძლია შევქმნათ პროგრამა რომელიც მომხმარებელს სთხოვს შეიყვანოს თავისი სახელი prompt()ით და შემდეგ მისალმების შეტყობინებას აჩვენებს alert ()ით მაგალითად:

let name = prompt("შეიყვანე შენი სახელი");
alert("მოგესალმებით, " + name + "!");
console.log(name)