//3) შექმენით პროგრამა, რომელიც მომხმარებელს სთხოვს პროდუქტის საწყის ფასს.
//პირველი prompt()-ით მოითხოვეთ ნივთის ფასი.
//მეორე prompt()-ით მოითხოვეთ ფასდაკლების პროცენტი (მაგალითად: 20).
//პროგრამამ უნდა გამოთვალოს საბოლოო ფასი ფორმულით: $ფასი - (ფასი \times პროცენტი / 100)$.
//alert()-ით გამოიტანეთ შეტყობინება: "თქვენი ნივთის ფასი ფასდაკლების შემდეგ არის: [შედეგი] ლარი".

let product = prompt("შეიყვანე პროდუქტის საწყისი ფასი");
let product2 = prompt("შეიყვანე ფასდაკლების პროცენტი");
let finalprice =  Number(product) - (Number(product) * Number(product2) / 100);
alert("თქვენი ნივთის ფასი ფასდაკლების შემდეგ არის: " + finalprice + " ლარი.")
console.log(finalprice)
