#1) კიდევ ერთხელ ახსენით რა არის მონაცემთა სტრუქტურა. მონაცემთა სტრუქტურა არის ორგანიზებული ფორმა, რომელიც გამოიყენება მონაცემების შენახვისა და ორგანიზებისთვის. ის განსაზღვრავს, თუ როგორ არის მონაცემები ორგანიზებული და როგორ შეიძლება მათზე ოპერაციების შესრულება.
#2) ახსენით რა არის სია. სია არის მონაცემთა სტრუქტურა, რომელიც გამოიყენება მონაცემების შენახვისა და ორგანიზებისთვის. 
#3) რისთვის გამოიყენება. გამოიყენება მონაცემების შენახვისა და ორგანიზებისთვის.
#4) როგორ იწერება სინტაქსურად (პითონში). სია იწერება კვადრატული ფრჩხილებით [] მაგალითად: list = ["apple", "banana", "orange"]
