#1) მარტივად ახსენით რა არის სია, როგორ იქმნება და რისთვის გამოიყენება სია არის მონაცემთა სტრუქტურა, რომელიც გამოიყენება მონაცემების შენახვისა და ორგანიზებისთვის. ის არის შეკრული ელემენტების კოლექცია, რომელიც შეიძლება შეიცავდეს სხვადასხვა ტიპის მონაცემებს, როგორიცაა რიცხვები, სტრიქონები ან სხვა სიის ელემენტები. სია შეიძლება შეიცავდეს დუბლიკატებს და მისი ზომა შეიძლება შეიცვალოს პროგრამის შესრულების დროს.
#2) შექმენით სია, სადაც იქნება განთავსებული ან სხვადასხვა ხილი, ადამიანის სახელები ან ნებისმიერი რამ
list = ["apple", "lizi", "banana"]
print(list)