#1) თქვენი სიტყვებით ახსენით რა არის ცვლადი, რისთვის გამოიყენება ცვლადი ეს არის სახელი რომელიც რაიმე მნიშვნელობას ინახავს კომპიუტერში
#2) ახსენით რა არის მონაცემთა ტიპი, ასევე დაასახელეთ ყველა რაც გავიარეთ და ასევე ახსენით რომელი რა არის მონაცემთა ტიპი განსაზღვრავს რა სახის ინფორმაცია ინახება ცვლადში და რა ოპერაციების შესრულება შეიძლება მასზე. int ინახავს მთელ რიცხვებს
#float ათწილად რიცხვებს str ტექსტს Bool true and false
#3) ახსენით რა არის ტერმინალი ტერმინალი არის ადგილი, სადაც:ვწერთ ბრძანებებს  ვუშვებთ პროგრამას ვხედავთ პროგრამის შედეგს
#4) ახსენით რას აკეთებს print() ფუნქცია, რატომ სჭირდება () რომ იმუშაოს print() ფუნქცია ბეჭდავს ინფორმაციას ეკრანზე
#5) ახსენით რას ნიშნავს სინტაქსი  ის გვიჩვენებს, როგორ სწორად უნდა დაიწეროს კოდი, რომ კომპიუტერმა გაიგოს.
#6) რა არის კომენტარი და რისთვის გამოიყენება კომენტარი არის ტექსტი კოდში, რომელსაც პროგრამა არ ასრულებს.იგი გამოიყენება იმისთვის, რომ: ავხსნათ რას აკეთებს კოდი
#7) ჩამოთვალეთ მაგალითები როგორ არ უნდა იწერებოდეს ცვლადის სახელი, რა შემთხვევაში იქნება არასწორი last name=""
#8) რა ქვია იმ ფუნქციას რომელიც რიცხვს ან მთელ რიცხვს გადააქცევს სტრინგად? string
#9) როგორ იწერება სტრინგი, რომელი სამი ბრჭყალი არის დაშვებული "text" 'text'
#10) რომელი ორი boolean არსებობს პროგრამირებაში true and false
#11) რა არის input() ფუნქცია, რას აკეთებს და რისთვის გამოიყენება? input() არის ფუნქცია რომელიც მომხმარებლისგან იღებს მონაცემს ტერმინალიდან.
#12) რა მონაცემთა ტიპად იღებს input() ფუნქცია, ნებისმიერს, გინდა იყოს რიცხვი ან ბულიანი input() ყოველთვის იღებს მონაცემს strad მნიშვნელობა არ აქვს მომხმარებელმა რიცხვი შეიყვანა ბულიანი თუ ტექსტი
#13) როგორ უნდა მოვახდინოთ მათემატიკური ოპერაცია input() ფუნქციის დახმარებით? (მომხმარებელს შემოვატანინოთ ორი რიცხვი) int ან float tit
#14) რა არის low-level და high-level პროგრამირების ენები? რა განსხვავებაა მათ შორის Low-level პროგრამირების ენა  ძალიან ახლოს არის კომპიუტერის ენასთან, High-level პროგრამირების ენა  ადამიანისთვის მარტივად წასაკითხი და დასაწერია.
#15) რატომ არის low-level პროგრამირების ენები სწრაფი high-level პროგრამირების ენებზე?კოდი პირდაპირ სრულდება პროცესორზე
#16) ახსენით რა არის პირობითი ოპერატორები პირობითი ოპერატორები გამოიყენება იმისთვის რომ პროგრამამ გადაწყვიტოს რა ქმედება შეასრულოს კონკრეტული პირობის მიხედვით.
#17)  რა არის ლოგიკური ოპერატორები ლოგიკური ოპერატორები გამოიყენება რამდენიმე პირობის ერთად შესამოწმებლად
#18) რა არის if-else statement? ზოგადად statement რას ნიშნავს  Statement არის პროგრამირების ენაში დასრულებული ბრძანება რომელსაც პროგრამა ასრულებს
#19) რამდენი შემთხვევებია if-else statement-ში, როგორ მუშოაბს და რისთვის გამოიყენება  როცა სწორია if როცა არასწორია else 
#20) დაწერეთ კოდი, სადაც მომხმარებელს მოთხოვთ თავიდანთ ასაკს, თუ მათი ასაკი მეტია 18ზე გამოიტანეთ 'დიდი ხარ', სხვა შემთხვევაში 'პატარა ხარ'

age = int(input("enter your age "))
if age > 18:
    print("didi xar")
else:
    print("patara xar")